<?php
require 'vendor/autoload.php';

use Nahid\Literature\Poem;

$poem = new Poem('বিদ্রোহী');
$poem->author('কাজী নজরুল ইসলাম', 'লেখক');

$poem->para(function ($line) {
    $line->বল()->বীর()->_('.');
    $line->বল()->উন্নত()->মম()->শির()->_();
    $line->শির()->নেহারি()->আমারি()->নতশির()->ঐ()->শিখর()->হিমাদ্রীর()->_('!')->_();
    $line->বল()->বীর()->_('!')->_();
});

$poem->para(function ($line) {
    $line->বল()->মহাবিশ্বের()->মহাকাশ()->ফাড়ি()->_();
    $line->চন্দ্র()->সূর্য্য()->গ্রহ()->তারা()->ছাড়ি()->_();
    $line->ভূলোক()->দূল্যোক()->গোলক()->ভেদিয়া()->_();
    $line->খোদর()->আসন()->আরশ()->ছেদিয়া()->_();
    $line->উঠিয়াছি()->চির()->_('-')->বিস্ময়()->আমি()->বিশ্ববিধাত্রীর()->_('!')->_();
});

$poem->publish();